#pragma once

#include <list>
#include "enemy.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define MAX_ENEMY_HITDORP 10		//敵の表示最大数

//*****************************************************************************
// ヒットドロップする敵のクラス
//*****************************************************************************
class EnemyFactory
{
private:
	std::list<Enemy*> m_pEnemyList;
public:
	EnemyFactory();
	// エネミー工場の初期化処理
	void Init();
	// エネミー工場の終了処理
	void Uninit();
	// エネミー工場の更新処理
	void Update();
	// エネミー工場の描画処理
	void Draw();
	~EnemyFactory();
};

