#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitNumber(void);
void UninitNumber(void);
void UpdateNumber(void);
void DrawNumber(void);

void SetNumber(int score);
