
/*==============================================================================

   タイトル画面 [title.cpp]
														 Author :
														 Date   :
--------------------------------------------------------------------------------

==============================================================================*/
#include "title.h"
#include "texture.h"
#include "sprite.h"
#include "input.h"
#include "sound.h"
#include "fade.h"
#include "inputx.h"


//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************

//*****************************************************************************
// グローバル変数
//*****************************************************************************
static int	g_TextureNo;	// テクスチャ識別子
static int	g_BGMNo;		// BGMの識別子

//=============================================================================
// 初期化処理
//=============================================================================
void InitTitle(void)
{
	//タイトル画面用テクスチャの読み込み
	g_TextureNo = LoadTexture((char*)"data/TEXTURE/title.png");

	//タイトル用BGMの読み込み
	g_BGMNo = LoadSound((char*)"data/BGM/sample000.wav");

	//BGM再生(二つ目の引数はループ回数 負の値を指定すると無限ループ)
	//PlaySound(g_BGMNo, -1);
}

void UninitTitle(void)
{
	//テクスチャの解放
//	UninitTexture();

	//BGMストップ
	StopSound(g_BGMNo);
}

void UpdateTitle(void)
{
	//スペースキーが押されたらゲームシーンへ移行する
	if (IsButtonPressedX(0, XINPUT_GAMEPAD_A))
	{
		SetFadeColor(0.0f, 0.0f, 0.0f, 0.0f);//フェードカラーを黒に変える
		SceneTransition(SCENE_GAME);
	}
}

void DrawTitle(void)
{
	DrawSpriteLeftTop(g_TextureNo, 0.0f, 0.0f, SCREEN_WIDTH, SCREEN_HEIGHT,
		0.0f, 0.0f, 1.0f, 1.0f);
}
