#pragma once

#include "main.h"
#include "renderer.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// プロトタイプ宣言
//*****************************************************************************
void InitEnemyEmitter(void);
void UninitEnemyEmitter(void);
void UpdateEnemyEmitter(void);
void DrawEnemyEmitter(void);
